HANDLING MISSING VALUES IN PANDAS

import data in pandas

In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_#na.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

1.isnull():checks which cells are missing

In [4]:
df.isnull() # it creates Bollean Arrays

    Name  Marks  Grades
0  False  False    True
1  False   True   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False   True   False
6  False  False   False

In [ ]:
df.isnull().sum()#sums the True values column-wise

Name      0
Marks     2
Grades    2
dtype: int64

In [9]:
df.isnull().sum().sum() # to check the null values in whole data

np.int64(4)

2.NOT NULL(): no missing  values in data

In [10]:
df.notnull()

   Name  Marks  Grades
0  True   True   False
1  True  False    True
2  True   True    True
3  True   True   False
4  True   True    True
5  True  False    True
6  True   True    True

In [12]:
df.notnull().sum()# sum of true values column wise

Name      7
Marks     5
Grades    5
dtype: int64

In [14]:
df.notnull().sum().sum()# to check the not null values in whole data

np.int64(17)

3. in the data set we have not avalliable,wrongdata in output we use na_values it gives NAN output in data set

First Load the data set

In [15]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m1.csv")
df

      Name  Marks         Grades
0  Priyang   98.0  not available
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0             BB

In [21]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m1.csv",na_values='not available')
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

keep_default_na:in the data set we have different nalues values ie is #NA,Null etc we replace with NAN using Keep_default_na

In [28]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_#na (1).csv")
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [30]:
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_#na (1).csv",keep_default_na=True)
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

4.DROPNA():we should delete the null values using dropna()

In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(i).DROP THE ROW  WHERE ATLEAST ONE VALUE IS MISSING

In [4]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df=df.dropna(axis='index',how='any')
df

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

In [6]:
df

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

(ii).DROP THE COLUMN WHERE ATLEAST ONE VALUE IS MISSING

In [8]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df=df.dropna(axis=1,how='any')
df

      Name
0  Priyang
1   Aadhya
2   Krisha
3   Vedant
4   Parshv
5   Mittal
6  Archana

In [10]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(iii).DROP THE ROWS WHERE ALL Values ARE MISSING

import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df=df.dropna(axis='index',how='any')
df => i.e is if all the rows are empty we use how =any

(iv).DROP THE columns WHERE ALL VALUES ARE MISSING

import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
df=df.dropna(axis='column',how='any')
df => i.e is if all the columns are empty we use how =any

5.FILLNA():fill the missing values in the data frame

import  csv data into pandas

In [14]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(i).FILL THE ALL NAN VALUES WITH 0

In [15]:
df.fillna(0)# scalar value

      Name  Marks Grades
0  Priyang   98.0      0
1   Aadhya    0.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0      0
4   Parshv   90.0     AC
5   Mittal    0.0     BA
6  Archana   82.0     BB

(ii). FLL ALL NAN VALUES WITH MEAN VALUES

In [16]:
df.fillna(df.mean)
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(iii).Fill All NAN ElEMENTS IN COLUMNS 'MARKS'&'GRADES' WITH 97 AND 'AA' RESPECTVELY

In [30]:
import pandas as pd
df = pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")   # read file

# fill NaN values in Marks column with 97
# fill NaN values in Grades column with 'AA'
df = df.fillna({'Marks': 97, 'Grades': 'AA'})
print(df)

      Name  Marks Grades
0  Priyang   98.0     AA
1   Aadhya   97.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AA
4   Parshv   90.0     AC
5   Mittal   97.0     BA
6  Archana   82.0     BB

FORWARD FILL:

In [34]:
import pandas as pd
df = pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")   # read file
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [ ]:
df.fillna(method='ffill')# FORWARD FILL

C:\Users\gnane\AppData\Local\Temp\ipykernel_14420\253117906.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya   98.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AA
4   Parshv   90.0     AC
5   Mittal   90.0     BA
6  Archana   82.0     BB

BACKWORD FILL

In [38]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_m.csv")   # read file
df

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

FILL THE NAN WITH BACKWORD FILL

In [42]:
df.fillna(method='backfill')
df

C:\Users\gnane\AppData\Local\Temp\ipykernel_14420\817512760.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='backfill')

      Name  Marks Grades
0  Priyang   98.0     AB
1   Aadhya   99.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AC
4   Parshv   90.0     AC
5   Mittal   82.0     BA
6  Archana   82.0     BB

6.PANDAS REPLACE: WE REPLACE NULL OR OLDER VALUES WITH  NEW VALUES

In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_#na.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(i).Replace "priyang" with "Anil.

In [6]:
df = df.replace('Priyang', 'Anil')
df

      Name  Marks Grades
0     Anil   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(ii) replace 2 values "priyang" ,"Aadhya"with "Anil.

In [7]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gnane\Downloads\data_#na.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [9]:
df['Name'] = df['Name'].replace(['Priyang', 'Aadhya'], 'Anil')
print(df)

      Name  Marks Grades
0     Anil   98.0    NaN
1     Anil    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

(iii) REPLACE NAN VALUE WITH 40

In [16]:
import numpy as np
import pandas as pd
df =pd.read_csv(r"C:\Users\gnane\Downloads\data_#na.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [18]:
import numpy as np
df = df.replace(np.nan, 40)
print(df)

      Name  Marks Grades
0  Priyang   98.0     40
1   Aadhya   40.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     40
4   Parshv   90.0     AC
5   Mittal   40.0     BA
6  Archana   82.0     BB

(iv).Replace Marks Column NaN with 40 and grades column NaN with'FF'

In [2]:
import numpy as np
import pandas as pd
df =pd.read_csv(r"C:\Users\gnane\Downloads\data_#na.csv")
print(df)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB